/********************************************************************************
* 版權：
* 模块名称：hardware.c
* 模块功能：
* 创建日期：
* 创 建 者：
* 声    明：
********************************************************************************
**/
#ifndef __MOTOR_PWM_
#define __MOTOR_PWM_

/***********************************
* 头文件
***********************************/
#include "datatype.h"
#include "stm32f0xx.h"

/**********************************
*宏定义
***********************************/

void Motor_PWM_Init(void);
void Motor_PWM_Freq_Dudy_Set(UINT8 PWM_NUMBER, UINT16 Freq,UINT16 Duty);			//PWM1-2-3,FREQ,DUFY

#endif
