#include "stm32f0xx.h"
#include "stm32f0xx_tim.h"
#include "stm32f0xx_rcc.h"

#include "delay.h"
#include "os_cfg.h"
#include "hardware.h"
#include "app.h"

#include "comm_task.h"
#include "key_power_on_task.h"
#include "hardware.h"
#include "i2c.h"
#include "Motor_pwm.h"
//#include "device_type.h"
#include "stm32f0xx_dma.h"
#include "iwtdg.h"

 const uint8_t default_parameter_buf[PARAMETER_BUF_LEN] = {
#if 1
		//common para
		1,2,
		//Mode1
		0x11,1,100,50,1,1,1,1,
		0x12,1,100,50,1,1,1,1,
		0x13,1,100,50,1,1,1,1,
		0x14,1,100,50,1,1,1,1,
		0x15,1,100,50,1,1,1,1,
		0x16,1,100,50,1,1,1,1,
		
		0x21,1,100,50,1,1,1,1,
		0x22,1,100,50,1,1,1,1,
		0x23,1,100,50,1,1,1,1,
		0x24,1,100,50,1,1,1,1,
		0x25,1,100,50,1,1,1,1,
		0x26,1,100,50,1,1,1,1,
		
		0x31,10,1,100,50,1,1,1,1,
		0x32,20,1,100,50,1,1,1,1,
		0x33,30,1,100,50,1,1,1,1,
		0x34,40,1,100,50,1,1,1,1,
		0x35,50,1,100,50,1,1,1,1,
		0x36,60,1,100,50,1,1,1,1,
		
		//Mode2
		0x11,1,100,50,1,1,1,1,
		0x12,1,100,50,1,1,1,1,
		0x13,1,100,50,1,1,1,1,
		0x14,1,100,50,1,1,1,1,
		0x15,1,100,50,1,1,1,1,
		0x16,1,100,50,1,1,1,1,
		
		0x21,1,100,50,1,1,1,1,
		0x22,1,100,50,1,1,1,1,
		0x23,1,100,50,1,1,1,1,
		0x24,1,100,50,1,1,1,1,
		0x25,1,100,50,1,1,1,1,
		0x26,1,100,50,1,1,1,1,
		
		0x31,10,1,100,50,1,1,1,1,
		0x32,20,1,100,50,1,1,1,1,
		0x33,30,1,100,50,1,1,1,1,
		0x34,40,1,100,50,1,1,1,1,
		0x35,50,1,100,50,1,1,1,1,
		0x36,60,1,100,50,1,1,1,1,
		
		//Mode3
		0x11,1,100,50,1,1,1,1,
		0x12,1,100,50,1,1,1,1,
		0x13,1,100,50,1,1,1,1,
		0x14,1,100,50,1,1,1,1,
		0x15,1,100,50,1,1,1,1,
		0x16,1,100,50,1,1,1,1,
		
		0x21,1,100,50,1,1,1,1,
		0x22,1,100,50,1,1,1,1,
		0x23,1,100,50,1,1,1,1,
		0x24,1,100,50,1,1,1,1,
		0x25,1,100,50,1,1,1,1,
		0x26,1,100,50,1,1,1,1,
		
		0x31,10,1,100,50,1,1,1,1,
		0x32,20,1,100,50,1,1,1,1,
		0x33,30,1,100,50,1,1,1,1,
		0x34,40,1,100,50,1,1,1,1,
		0x35,50,1,100,50,1,1,1,1,
		0x36,60,1,100,50,1,1,1,1,
		//checksum,不需要
		0x28,0x35
		#endif
	};

	
int main(void)
{
	//Init_iWtdg(4,1250);  //4*2^4=64分频，1250(大概是1250*1.6ms=2s)
  delay_init();
	
	os_init();
	//Motor_PWM_Init();
	
	//Init_sysTick(48);  //48M
////	//进入stop模式
	EnterStopMode();
	//唤醒之后先初始化系统
	//set_led(LED_ID_MODE1,TRUE);
	init_system_afterWakeUp();
		
	os_create_task(init_task, OS_TRUE, INIT_TASK_ID);
	os_start();

	return 0;
}

#ifdef  USE_FULL_ASSERT

void assert_failed(uint8_t* file, uint32_t line)
{
  while (1)
  {
  }
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
